import streamlit as st

st.title("みっふぃさん占い(ASCなし≒出生時間不明)")

st.write("太陽　双子座05.08度/10ハウス\n\n",

"[キーワード]情報収集、私的欲求を満たす、フットワークを軽く、新しいチャンネルを求める、知識を広げる、旅、器用貧乏、ずる賢く、要領よく立ち回る、何位一つ習得せず、三日坊主、フリーター、好奇心旺盛、身軽、経験豊富、充実した\n\n",

"[太陽と双子座[♊️:gemini]]双子座は知恵と情報、そしてコミュニケーションの星座。ここに太陽が入っていると、あらゆる情報を収集し、知識を身につけ、それを武器に人との交流を図ることで、人生を楽しく豊かに送ろうとします。この太陽のパワーがうまく機能していると、あなたは面白いことや刺激的なことを常に求めて歩きます。時にはいくつものことを同時進行させながら、多彩な能力を駆使して有意義な人生を送っていくのです。けれども、太陽の力が発揮されなければ、いろいろなことに手を染めるものの、何ひとつ習得できないことに。器用貧乏な人生に終わってしまうこともありがちなのです。\n\n",

"月　乙女座11.06度/1ハウス\n\n",

"[キーワード]冷静、純情、常識的、謙虚、分析的、思慮深く、ひたむき、控えめ、世話好き、親身、誠実、良識的、几帳面、繊細、否定的、批判的、神経質、被害妄想的、怖気付き、ナイーブ、完璧主義、清潔好き、ロマンティック\n\n",

"[月と乙女座[♍️:virgo]]乙女座の月は、繊細でナイーブな心と思慮深さを、あなたに与えています。それでいてどこか純粋無垢で清潔感があり、ロマンティックな感情も持っています。秩序を重んじ、無意識のうちに完璧さを求めてしまうのも、月が乙女座の特性です。この月の力がうまく働くと、細やかな気配りができ、随所に目がいき届くパーフェクトな人に。慎重にことを進め、失敗も少ないでしょう。しかし、月のエネルギーがマイナスに作用してしまうと、細やかな感情も神経質という形で現れてきます。気配りが利きすぎて口うるさくなったり、完璧を求めすぎて相手を批判したり、潔癖な面も出てきます。\n\n",

"水星　牡牛座19.44度/9ハウス(R'=逆行)\n\n",

"[キーワード]鈍くなる、時間がかかる、着実にマスター、スペシャリスト、さびつく、他者を受け入れない、経営センスを発揮、思考停止、邪推、覚醒、しどろもどろ、休眠状態\n\n",

"[水星と牡牛座[♉️:taurus]]なれない仕事や作業をするときは、人の倍の時間がかかりますが、なれてくると精度も時間もアップするのが、水星が牡牛座の人。この水星の力がうまく活かされていればひとつの技術をマスターし、その分野でスペシャリストになることもあり得ます。他に、鋭い五感を活かした職種も才能が発揮できる仕事です。ただ、水星の力がマイナスに働くと、頑固な面が出てきます。ひとつの考えに固執したり、他人の意見を頑として受け入れないことも。柔軟に対応しないと周囲から浮いてしまいます。また、思ったことをその場で言わず、後になってグチグチ言いがちな点は要注意。\n\n",

"金星　双子座27.35度/10ハウス(R'=逆行)\n\n",

"[キーワード]相手を振り回し、移り気、新鮮、刺激を求める、経験豊富、早熟、ラブゲーム、相手と共に成長できる、急に冷める、本気で人を好きになれない、深く考えない、長続きしない、飽きっぽい、楽しい、相手を尊重する、二股を掛ける\n\n",

"[金星と双子座[♊️:gemini]]刺激的で変化を求めるのが、金星が双子座にある人の恋愛傾向。この人といると次々といろんなことが経験でき、一緒にいて楽しい--そんな相手との恋愛を望んでいます。この金星がうまく働いていると、あなたは相手を飽きさせません。知的で軽妙な会話、くるくると変わる表情、甘えたかと思うとクールに突き放す面もあり、相手の心を掴んで離さないでしょう。ところが、金星の力がマイナスに作用すると、変化を求めるあまり次々と相手を変えたり、同時に複数の人にアプローチをしかけたりも、そのくせ心は冷めていて、本気で人を愛せないこともあるのです。\n\n",

"火星　牡牛座17.20度/9ハウス\n\n",

"[キーワード]鬱屈した気分の続く、頑固な、むくれがちな、怒りを溜め込んだ、意地汚い、しつこいと言われる、不快感の強い、粘り強い、断固として譲らない、根気良く、持続的な、疲れ知らずの、Yesと言わせる\n\n",

"[火星と牡牛座[♉️:taurus]]つまらないことで頑固になったり、むくれてしまったりするあなた。意地を張ったせいで恋をダメにしたり、「しつこい人」と言われて傷ついたりした経験が、あなたにはあるはず。また、自分の性的な欲望の強さに振り回され、肉体関係を断ち切れないこともあるかもしれません。けれど、この牡牛座的な火星のパワーを上手に発揮することができるようになれば、あなたは常に確実に、自分の目標、目的を達成することが可能となるでしょう。粘り強く、根気良く、欲しいもの人近づいていくことのできるあなたは、大地に根を張る大木のような強さをもっている人なのです。\n\n",

"木星　山羊座16.56度/5ハウス(R'=逆行)\n\n",

"[キーワード]実力不足、何事も人頼み、小さなことにビクビクする、社会的地位の獲得、プレッシャーに弱い、40代以降も大恋愛を重ねられる、ステイタスある相手との結婚、ヘッドハンティングを得る\n\n",

"[木星と山羊座[♑️:capricorn]]山羊座は合理性に富む星座です。そこに木星があるあなたは、確実性を追い求めることで、幸運を手に入れる人。一か八かのギャンブルでは、大きな幸運を手にするのは難しいでしょう。棚ぼた的な幸運ばかりを狙っていると、自分の実力を磨くチャンスを失い、いざという時にプレッシャーに負けて幸せを逃すことに。あなたには「自分の実力で手に入れた」と胸を張って言えるような幸運の取得の方が似合います。大切なのは、小さな目標や願いを一つ一つ叶えていくこと。その積み重ねが自信と実力となり、それが次なる目標の達成につながっていくのです。\n\n",

"土星　牡羊座05.04度/8ハウス\n\n",

"[キーワード]ライバルを怖れ、恋人を他の女性に奪われる、自己の限界にぶち当たる、自分より強そうな相手に怖気付く、果敢に、力強く、自力で、ファイティングスピリッツを持って、勇敢に、負けることを恐れず\n\n",

"[土星と牡羊座[♈️:aries]]闘争本能の強い牡羊座にある土星は、戦うことに対するコンプレックスを作り出します。あなたの中には他人に負けるのを恐れる気持ちと、他人を打ち負かすことへの恐れがあるはず、そのため仕事や恋のシーンで敗北することがあると、それ以降、人と競うことをことごとく避けるようになるかもしれません。またコンプレックスのせいで、大事な場面で他人に勝ちを譲ってしまう、ということも起こってくるでしょう。しかし、土星の示す苦手分野は時間をかけて克服すれば、最大の強みとなるもの。戦いに対する恐れに打ち勝った時、あなたは最高の勝利を手にするはずです。\n\n",

"天王星　水瓶座04.27度/5ハウス(R'=逆行)\n\n",

"[キーワード]特になし。\n\n",

"[天王星と水瓶座[♒️:aquarius]]天王星は水瓶座の支配星にあたります。ここに天王星が位置していると、そのパワーは増大することになります。あなたの人生は常に変革や改革と無縁なものではいられないでしょう。あなたの属する世代が中心となり、次の時代のムーブメントを起こしていくという可能性も非常に強いです。また、不正や不平等を正そうとする意識も強く、共感する人間と連帯して社会を変えようとするパワーに満ちています。\n\n",

"海王星　山羊座27.34度/5ハウス(R'=逆行)\n\n",

"[キーワード]特になし。\n\n",

"[海王星と山羊座[♑️:capricorn]]権力思考への憧れを、この世代は持ちやすく、肩書きに弱いという傾向を持っています。その憧れを自分のものにしようと、努力、精進するムードがこの世代に広まっていけば、優秀な人物、偉大な政治家などを輩出するようになるでしょう。けれども、権力への陶酔感に溺れてしまうと、地位や肩書を振りかざすような人物が増えてしまい、弱肉強食の殺伐とした社会を生み出すことになる危険もあります。\n\n",

"冥王星　射手座01.39度/4ハウス(R'=逆行)\n\n",

"[キーワード]特になし。\n\n",

"[冥王星と射手座[♐️:sagitarius]]冒険を愛する射手座。この星座に冥王星が入っている時代兄は、ボブ兼的な取り組みにさまざまな犠牲が伴うことになるかもしれません。不死や理想郷などを求めたがゆえに味わう挫折。限界を突破しようとする挑戦が引き起こす悲劇。そういうものを、この時代に生きる人は体験することになるでしょう。その体験を通じて生まれて来るのは、新たな倫理観や哲学。悲劇を繰り返さないための知恵が生まれるはずです。\n\n")